---
kind: type
id: T:Autodesk.Revit.DB.FacetingUtils
source: html/e32f9a9e-3f99-292d-7221-192bb21267fd.htm
---
# Autodesk.Revit.DB.FacetingUtils

This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles
 have been consolidated into quadrilaterals.

## Syntax (C#)
```csharp
public static class FacetingUtils
```